In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Bank Dataset

In [7]:
import arff
import pandas as pd

# Load the ARFF file
with open('bank-additional-ful-nominal.arff') as f:
    dataset = arff.load(f)

# Convert to DataFrame
df_bank = pd.DataFrame(dataset['data'])

# Optionally, set column names if they are present in the ARFF file
if 'attributes' in dataset.keys():
    df_bank.columns = [attr[0] for attr in dataset['attributes']]

df_bank.head()

,job,marital,education,default,housing,loan,contact,month,day_of_week,poutcome,y
0,housemaid,married,basic.4y,no,no,no,telephone,may,mon,nonexistent,no
1,services,married,high.school,unknown,no,no,telephone,may,mon,nonexistent,no
2,services,married,high.school,no,yes,no,telephone,may,mon,nonexistent,no
3,admin.,married,basic.6y,no,no,no,telephone,may,mon,nonexistent,no
4,services,married,high.school,no,no,yes,telephone,may,mon,nonexistent,no

In [8]:
# summary of the data
df_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41188 entries, 0 to 41187
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   job          41188 non-null  object
 1   marital      41188 non-null  object
 2   education    41188 non-null  object
 3   default      41188 non-null  object
 4   housing      41188 non-null  object
 5   loan         41188 non-null  object
 6   contact      41188 non-null  object
 7   month        41188 non-null  object
 8   day_of_week  41188 non-null  object
 9   poutcome     41188 non-null  object
 10  y            41188 non-null  object
dtypes: object(11)
memory usage: 3.5+ MB

In [9]:
# statistics of the data
df_bank.describe()

,job,marital,education,default,housing,loan,contact,month,day_of_week,poutcome,y
count,41188,41188,41188,41188,41188,41188,41188,41188,41188,41188,41188
unique,12,4,8,3,3,3,2,10,5,3,2
top,admin.,married,university.degree,no,yes,no,cellular,may,thu,nonexistent,no
freq,10422,24928,12168,32588,21576,33950,26144,13769,8623,35563,36548

In [10]:
# unique values in each column
for col in df_bank.columns:
    print(col, df_bank[col].unique(), len(df_bank[col].unique()))

job ['housemaid' 'services' 'admin.' 'blue-collar' 'technician' 'retired'
 'management' 'unemployed' 'self-employed' 'unknown' 'entrepreneur'
 'student'] 12
marital ['married' 'single' 'divorced' 'unknown'] 4
education ['basic.4y' 'high.school' 'basic.6y' 'basic.9y' 'professional.course'
 'unknown' 'university.degree' 'illiterate'] 8
default ['no' 'unknown' 'yes'] 3
housing ['no' 'yes' 'unknown'] 3
loan ['no' 'yes' 'unknown'] 3
contact ['telephone' 'cellular'] 2
month ['may' 'jun' 'jul' 'aug' 'oct' 'nov' 'dec' 'mar' 'apr' 'sep'] 10
day_of_week ['mon' 'tue' 'wed' 'thu' 'fri'] 5
poutcome ['nonexistent' 'failure' 'success'] 3
y ['no' 'yes'] 2

In [11]:
# number of unique values in each column
sum([len(df_bank[col].unique()) for col in df_bank.columns])

55

In [12]:
# proportion of  yes and no in the target column
df_bank['y'].value_counts(normalize=True)

y
no     0.887346
yes    0.112654
Name: proportion, dtype: float64

In [13]:
# number of unique values in each column
df_bank['y'].value_counts()

y
no     36548
yes     4640
Name: count, dtype: int64

In [14]:
# save the dataframe as a csv file
df_bank.to_csv('bank-additional-ful-nominal.csv', index=False)